app/controllers/api/posts_controller.rb

  def index
    @posts = User.find(params[:user_id]).posts
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]