app/views/api/posts/index.json.jbuilder

        post.likes.each do |like|
            user2 = User.find(like.author_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]