app/views/api/users/_user.json.jbuilder

INSERT INTO "users" ("first_name", "last_name", "email", "DOB", "gender", "password_digest", "session_token", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---

json.createdAt user.created_at.strftime('%-B %-Y')